Revit 2024 API
SpecTypeId.PipingViscosity Property
 Dynamic Viscosity, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipingViscosity { get; }
Visual Basic
Public Shared ReadOnly Property PipingViscosity As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipingViscosity {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace